results/abNginxJustProxyImage.txt
stephen@comet:~$ ab -n100000 -c100 -g plotdata.tsv http://meteor/image.jpg
This is ApacheBench, Version 2.3 <$Revision: 1528965 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking meteor (be patient)
Completed 10000 requests
Completed 20000 requests
Completed 30000 requests
Completed 40000 requests
Completed 50000 requests
Completed 60000 requests
Completed 70000 requests
Completed 80000 requests
Completed 90000 requests
Completed 100000 requests
Finished 100000 requests


Server Software:        nginx/1.4.6
Server Hostname:        meteor
Server Port:            80

Document Path:          /image.jpg
Document Length:        100018 bytes

Concurrency Level:      100
Time taken for tests:   150.812 seconds
Complete requests:      100000
Failed requests:        0
Total transferred:      10033200000 bytes
HTML transferred:       10001800000 bytes
Requests per second:    663.08 [#/sec] (mean)
Time per request:       150.812 [ms] (mean)
Time per request:       1.508 [ms] (mean, across all concurrent requests)
Transfer rate:          64968.57 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.4      0      10
Processing:     3  150  58.7    148     472
Waiting:        1  113  41.5    114     420
Total:          3  151  58.7    149     473

Percentage of the requests served within a certain time (ms)
  50%    149
  66%    167
  75%    181
  80%    191
  90%    223
  95%    255
  98%    293
  99%    315
 100%    473 (longest request)