results/abNginxJustProxyRoot.txt
stephen@comet:~$ ab -n100000 -c100 -g plotdata.tsv http://meteor/
This is ApacheBench, Version 2.3 <$Revision: 1528965 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking meteor (be patient)
Completed 10000 requests
Completed 20000 requests
Completed 30000 requests
Completed 40000 requests
Completed 50000 requests
Completed 60000 requests
Completed 70000 requests
Completed 80000 requests
Completed 90000 requests
Completed 100000 requests
Finished 100000 requests


Server Software:        nginx/1.4.6
Server Hostname:        meteor
Server Port:            80

Document Path:          /
Document Length:        687 bytes

Concurrency Level:      100
Time taken for tests:   106.313 seconds
Complete requests:      100000
Failed requests:        0
Total transferred:      87800000 bytes
HTML transferred:       68700000 bytes
Requests per second:    940.62 [#/sec] (mean)
Time per request:       106.313 [ms] (mean)
Time per request:       1.063 [ms] (mean, across all concurrent requests)
Transfer rate:          806.51 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.3      0      12
Processing:    11  106  10.6    105     260
Waiting:       11  106  10.6    104     260
Total:         21  106  10.5    105     260

Percentage of the requests served within a certain time (ms)
  50%    105
  66%    110
  75%    112
  80%    113
  90%    118
  95%    124
  98%    131
  99%    134
 100%    260 (longest request)